emacs/.emacs.d/backups/!usr!local!src!dev!repos!nm!tnm!tools!tnm_load_test!nbi_stuff!get_allPgs.xml~

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:v11="http://www.tmforum.org/mtop/rtm/xsd/pr/v1" xmlns:v12="http://www.tmforum.org/mtop/fmw/xsd/nam/v1">
   <soapenv:Header>
      <v1:header>
         <v1:communicationPattern>MultipleBatchResponse</v1:communicationPattern>
         <v1:requestedBatchSize>1</v1:requestedBatchSize>
         <v1:batchSequenceNumber>1</v1:batchSequenceNumber>
      </v1:header>
   </soapenv:Header>
   <soapenv:Body>
      <v11:getAllProtectionGroupsRequest>
      </v11:getAllProtectionGroupsRequest>
   </soapenv:Body>
</soapenv:Envelope>
